From: kdavis@ndx.net (Kirk B. Davis)
Date: Mon, 28 Jan 2002 21:10:09 -0800 (PST)
Subject: [pups] Problems booting PDP11/40 using vtserver
In-Reply-To: <Pine.NEB.4.21.0201261730360.568-100000@server.michiw.org>
References: <Pine.NEB.4.21.0201261730360.568-100000@server.michiw.org>
Message-ID: <51795.216.103.73.141.1012281009.squirrel@bender.ndx.net>

Hmm, tricky. If you send me the 11/40, I'll have look for you :-)

Kirk

> Hi there,
> 
> I have my PDP11/40 connected to a MicroVAX 2 (running NetBSD/vax
> 1.5.2) via serial line and want to boot a 2.9BSD or 2.11BSD using 
the
> vtserver software.
> When I toggle in vtserver's boot code, the first file is being loaded
> correctly by the PDP. Then, following the instructions in vtserver
> documentation, the serial line should be used as a serial console - 
and
> some text should appear! And this is the problem: I don't get any
> output.
> 
> When manually sending characters from the PDP, there is no 
problem.
> I've set the serial line characteristics to:
> Speed 2400, Character Size 8, Modem Control enabled, and RTS/
CTS flow
> control disabled. (I've changed these characteristics in many ways 
with
> stty, but still no success...)
> Using a break-out-box, I switched RTS/CTS and DTR/CTS flow 
control on
> and off, forced the CTS line to be on, etc., but it still didn't work.
> After successfully loading the bootloader via vtserver, the PDP's 
CPU
> goes into an endless loop.
> 
> So, my question: Does anybody know what's going wrong here?
> 
> Thanks in advance - Michi
> 
> 
> _______________________________________________
> PUPS mailing list
> PUPS at minnie.tuhs.org
> http://minnie.tuhs.org/mailman/listinfo/pups




